---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult
source: html/def069dd-2e03-7b93-6482-9bf28c70e7ed.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult

Errors for the Free Form Rebar

## Syntax (C#)
```csharp
public enum RebarFreeFormValidationResult
```